
       identification division.
       program-id. hello-world.
       author. Esko
       date-written. 2018-06-08
       procedure division.
           display 'HELLO COBOL weirdos!'.
           stop run.
